fonecmid-diplom/src/Documents/ВКМ_НачислениеЗарплаты/ВКМ_НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗарплаты</name>
  <registerRecords>AccumulationRegister.ОстаткиОтпусковСотрудников</registerRecords>
  <registerRecords>CalculationRegister.Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ДополнительныеНачисления</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Оклад</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентОтРабот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДФЛ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КВыплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/УсловияОплатыСотрудников/УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>ВКМ_КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВзаиморасчетыССотрудниками/ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/CalculationRegisters/ОсновныеНачисления/ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/Удержания/Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Удержания</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.Удержания</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ОстаткиОтпусковСотрудников/ОстаткиОтпусковСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиОтпусковСотрудников</name>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_НачислениеЗарплаты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	НачПериода = НачалоМесяца(Период);
	КонПериода = КонецМесяца(Период);
	
	ВидОклад = ПланыВидовРасчета.ОсновныеНачисления.НайтиПоКоду("ЗП");
	ВидПроцент = ПланыВидовРасчета.ОсновныеНачисления.НайтиПоКоду("ПРОЦ");
	ВидНДФЛ = ПланыВидовРасчета.Удержания.НайтиПоКоду("НЛГ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УсловияОплатыСотрудников.Сотрудник КАК Сотрудник,
	|	УсловияОплатыСотрудников.Оклад КАК Оклад,
	|	УсловияОплатыСотрудников.ПроцентОтРабот КАК ПроцентОтРабот,
	|	ВЫБОР
	|		КОГДА УсловияОплатыСотрудников.Оклад > 0
	|			ТОГДА УсловияОплатыСотрудников.Оклад
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаОклада,
	|	ЕСТЬNULL(ВыполненныеРаботы.СуммаРабот, 0) КАК СуммаРабот
	|ИЗ
	|	РегистрСведений.УсловияОплатыСотрудников КАК УсловияОплатыСотрудников
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|	(
	|		ВЫБРАТЬ
	|			ВКМ_ВыполненныеКлиентуРаботы.ВКМ_Специалист КАК Сотрудник,
	|			СУММА(ВКМ_ВыполненныеКлиентуРаботы.ВКМ_СуммаКОплате) КАК СуммаРабот
	|		ИЗ
	|			РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
	|		ГДЕ
	|			ВКМ_ВыполненныеКлиентуРаботы.Период МЕЖДУ &НачПериода И &КонПериода
	|		СГРУППИРОВАТЬ ПО
	|			ВКМ_ВыполненныеКлиентуРаботы.ВКМ_Специалист
	|	) КАК ВыполненныеРаботы
	|		ПО УсловияОплатыСотрудников.Сотрудник = ВыполненныеРаботы.Сотрудник
	|ГДЕ
	|	УсловияОплатыСотрудников.Период = &Период
	|	И (УсловияОплатыСотрудников.Оклад > 0
	|			ИЛИ УсловияОплатыСотрудников.ПроцентОтРабот > 0)";
	
	Запрос.УстановитьПараметр("Период", НачПериода);
	Запрос.УстановитьПараметр("НачПериода", НачПериода);
	Запрос.УстановитьПараметр("КонПериода", КонПериода);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	// --- Сохраняем дни отпуска перед очисткой ---
	ДниОтпусков = Новый Соответствие;
	Для Каждого Строка Из Начисления Цикл
		Если Строка.КоличествоДнейОтпуска > 0 Тогда
			ДниОтпусков.Вставить(Строка.Сотрудник, Строка.КоличествоДнейОтпуска);
		КонецЕсли;
	КонецЦикла;
	
	Начисления.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		Сотрудник = Выборка.Сотрудник;
		СуммаОклада = Выборка.СуммаОклада;
		СуммаРабот = Выборка.СуммаРабот;
		Процент = Выборка.ПроцентОтРабот;
		
		СуммаПоПроценту = СуммаРабот * Процент / 100;
		Итого = СуммаОклада + СуммаПоПроценту;
		НДФЛ = Окр(Итого * 13 / 100, 2);
		КВыплате = Итого - НДФЛ;
		
		КоличествоДнейОтпуска = 0;
		Если ДниОтпусков.Получить(Сотрудник) <> Неопределено Тогда
			КоличествоДнейОтпуска = ДниОтпусков.Получить(Сотрудник);
		КонецЕсли;
		
		СтрокаТЧ = Начисления.Добавить();
		СтрокаТЧ.Сотрудник = Сотрудник;
		СтрокаТЧ.Оклад = СуммаОклада;
		СтрокаТЧ.ПроцентОтРабот = СуммаПоПроценту;
		СтрокаТЧ.Итого = Итого;
		СтрокаТЧ.НДФЛ = НДФЛ;
		СтрокаТЧ.КоличествоДнейОтпуска = КоличествоДнейОтпуска;
		СтрокаТЧ.КВыплате = КВыплате;
		
	КонецЦикла;
	
	// --- Очистка движений ---
	Движения.ВзаиморасчетыССотрудниками.Очистить();
	Движения.ОсновныеНачисления.Очистить();
	Движения.Удержания.Очистить();
	Движения.ОстаткиОтпусковСотрудников.Очистить();
	
	Движения.ОсновныеНачисления.Записывать = Истина;
	Движения.Удержания.Записывать = Истина;
	Движения.ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.ОстаткиОтпусковСотрудников.Записывать = Истина;
	
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		
		Если ТекСтрокаНачисления.Оклад > 0 И ВидОклад <> Неопределено Тогда
			Движение = Движения.ОсновныеНачисления.Добавить();
			Движение.Сторно = Ложь;
			Движение.ПериодРегистрации = Дата;
			Движение.ПериодДействияНачало = НачПериода;
			Движение.ПериодДействияКонец = КонПериода;
			Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
			Движение.Сумма = ТекСтрокаНачисления.Оклад;
			Движение.ВидРасчета = ВидОклад;
		КонецЕсли;
		
		Если ТекСтрокаНачисления.ПроцентОтРабот > 0 И ВидПроцент <> Неопределено Тогда
			Движение = Движения.ОсновныеНачисления.Добавить();
			Движение.Сторно = Ложь;
			Движение.ПериодРегистрации = Дата;
			Движение.ПериодДействияНачало = НачПериода;
			Движение.ПериодДействияКонец = КонПериода;
			Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
			Движение.Сумма = ТекСтрокаНачисления.ПроцентОтРабот;
			Движение.ВидРасчета = ВидПроцент;
		КонецЕсли;
		
		Если ТекСтрокаНачисления.НДФЛ > 0 И ВидНДФЛ <> Неопределено Тогда
			Движение = Движения.Удержания.Добавить();
			Движение.Сторно = Ложь;
			Движение.ПериодРегистрации = Дата;
			Движение.ПериодДействияНачало = НачПериода;
			Движение.ПериодДействияКонец = КонПериода;
			Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
			Движение.Сумма = ТекСтрокаНачисления.НДФЛ;
			Движение.ВидРасчета = ВидНДФЛ;
		КонецЕсли;
		
		Если ТекСтрокаНачисления.КВыплате <> 0 Тогда
			ДвижениеВР = Движения.ВзаиморасчетыССотрудниками.Добавить();
			ДвижениеВР.ВидДвижения = ВидДвиженияНакопления.Приход;
			ДвижениеВР.Период = Дата;
			ДвижениеВР.Сотрудник = ТекСтрокаНачисления.Сотрудник;
			ДвижениеВР.Сумма = ТекСтрокаНачисления.КВыплате;
		КонецЕсли;
		
		// --- Отпуск: только дни ---
		Если ТекСтрокаНачисления.КоличествоДнейОтпуска > 0 Тогда
			
			ДвижениеОтпуск = Движения.ОстаткиОтпусковСотрудников.Добавить();
			ДвижениеОтпуск.ВидДвижения = ВидДвиженияНакопления.Расход;
			ДвижениеОтпуск.Период = НачПериода;
			ДвижениеОтпуск.Сотрудник = ТекСтрокаНачисления.Сотрудник;
			ДвижениеОтпуск.КоличествоДней = ТекСтрокаНачисления.КоличествоДнейОтпуска;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
